---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPipeStandard
source: html/d818f5df-bc4d-2ef4-55e9-dc88dfddc3ac.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPipeStandard

Defines parameters for pipes also known as RoundHSS or HollowStructuralSection (HSS).

## Syntax (C#)
```csharp
public class StructuralSectionPipeStandard : StructuralSectionGeneralR
```